
## :x: Apply Failed

[CI link](https://github.com/goda6565/portfolio/actions/runs/15101858600)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.cloudbuild_connection.data.google_secret_manager_secret_version.github_oauth_token: Reading...
module.bootstrap.data.google_project.project: Reading...
module.bootstrap.data.google_iam_role.roles_storage_object_user: Reading...
module.bootstrap.google_iam_workload_identity_pool.github_actions_pool: Refreshing state... [id=projects/portfolio-460206/locations/global/workloadIdentityPools/github-actions-wip-pool]
module.bootstrap.google_service_account.terraform_executor: Refreshing state... [id=projects/portfolio-460206/serviceAccounts/terraform-executor@portfolio-460206.iam.gserviceaccount.com]
module.bootstrap.google_project_service.service["storage.googleapis.com"]: Refreshing state... [id=portfolio-460206/storage.googleapis.com]
module.bootstrap.google_project_service.service["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=portfolio-460206/cloudresourcemanager.googleapis.com]
module.bootstrap.google_project_service.service["secretmanager.googleapis.com"]: Refreshing state... [id=portfolio-460206/secretmanager.googleapis.com]
module.bootstrap.google_project_service.service["iam.googleapis.com"]: Refreshing state... [id=portfolio-460206/iam.googleapis.com]
module.bootstrap.google_project_service.service["cloudbuild.googleapis.com"]: Refreshing state... [id=portfolio-460206/cloudbuild.googleapis.com]
module.bootstrap.google_project_service.service["run.googleapis.com"]: Refreshing state... [id=portfolio-460206/run.googleapis.com]
module.bootstrap.data.google_iam_role.roles_storage_object_user: Read complete after 0s [id=roles/storage.objectUser]
module.bootstrap.google_project_service.service["iap.googleapis.com"]: Refreshing state... [id=portfolio-460206/iap.googleapis.com]
module.bootstrap.google_project_service.service["sts.googleapis.com"]: Refreshing state... [id=portfolio-460206/sts.googleapis.com]
module.bootstrap.data.google_project.project: Read complete after 0s [id=projects/portfolio-460206]
module.bootstrap.google_project_service.service["artifactregistry.googleapis.com"]: Refreshing state... [id=portfolio-460206/artifactregistry.googleapis.com]
module.cloudbuild_connection.data.google_secret_manager_secret_version.github_oauth_token: Read complete after 1s [id=projects/186242794041/secrets/github-host-github-oauthtoken-f6b0df/versions/1]
module.bootstrap.google_project_iam_member.terraform_executor: Refreshing state... [id=portfolio-460206/roles/owner/serviceAccount:terraform-executor@portfolio-460206.iam.gserviceaccount.com]
module.bootstrap.google_iam_workload_identity_pool_provider.github_actions_pool_provider: Refreshing state... [id=projects/portfolio-460206/locations/global/workloadIdentityPools/github-actions-wip-pool/providers/github-actions-pool-provider]
module.bootstrap.google_project_iam_custom_role.custom_storage_object_user: Refreshing state... [id=projects/portfolio-460206/roles/customStorageObjectUser]
module.bootstrap.google_service_account_iam_member.terraform_workload_identity_user: Refreshing state... [id=projects/portfolio-460206/serviceAccounts/terraform-executor@portfolio-460206.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/186242794041/locations/global/workloadIdentityPools/github-actions-wip-pool/attribute.repository/goda6565/portfolio]
module.bootstrap.google_storage_bucket_iam_member.terraform_executor_storage_object_user: Refreshing state... [id=b/portfolio-shared-terraform-backend/projects/portfolio-460206/roles/customStorageObjectUser/serviceAccount:terraform-executor@portfolio-460206.iam.gserviceaccount.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cloudbuild_connection.google_cloudbuildv2_connection.github_connection will be created
  + resource "google_cloudbuildv2_connection" "github_connection" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + etag                  = (known after apply)
      + id                    = (known after apply)
      + installation_state    = (known after apply)
      + location              = "asia-northeast1"
      + name                  = "github-connection"
      + project               = "portfolio-460206"
      + reconciling           = (known after apply)
      + update_time           = (known after apply)

      + github_config {
          + app_installation_id = 58532167

          + authorizer_credential {
              + oauth_token_secret_version = "projects/186242794041/secrets/github-host-github-oauthtoken-f6b0df/versions/1"
              + username                   = (known after apply)
            }
        }
    }

  # module.cloudbuild_connection.google_project_iam_member.cloudbuild_roles["roles/artifactregistry.writer"] will be created
  + resource "google_project_iam_member" "cloudbuild_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:cloudbuild-deployer@portfolio-460206.iam.gserviceaccount.com"
      + project = "portfolio-460206"
      + role    = "roles/artifactregistry.writer"
    }

  # module.cloudbuild_connection.google_project_iam_member.cloudbuild_roles["roles/cloudbuild.workerPoolUser"] will be created
  + resource "google_project_iam_member" "cloudbuild_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:cloudbuild-deployer@portfolio-460206.iam.gserviceaccount.com"
      + project = "portfolio-460206"
      + role    = "roles/cloudbuild.workerPoolUser"
    }

  # module.cloudbuild_connection.google_project_iam_member.cloudbuild_roles["roles/iam.serviceAccountUser"] will be created
  + resource "google_project_iam_member" "cloudbuild_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:cloudbuild-deployer@portfolio-460206.iam.gserviceaccount.com"
      + project = "portfolio-460206"
      + role    = "roles/iam.serviceAccountUser"
    }

  # module.cloudbuild_connection.google_project_iam_member.cloudbuild_roles["roles/logging.logWriter"] will be created
  + resource "google_project_iam_member" "cloudbuild_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:cloudbuild-deployer@portfolio-460206.iam.gserviceaccount.com"
      + project = "portfolio-460206"
      + role    = "roles/logging.logWriter"
    }

  # module.cloudbuild_connection.google_project_iam_member.cloudbuild_roles["roles/run.admin"] will be created
  + resource "google_project_iam_member" "cloudbuild_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:cloudbuild-deployer@portfolio-460206.iam.gserviceaccount.com"
      + project = "portfolio-460206"
      + role    = "roles/run.admin"
    }

  # module.cloudbuild_connection.google_project_iam_member.cloudbuild_roles["roles/secretmanager.secretAccessor"] will be created
  + resource "google_project_iam_member" "cloudbuild_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:cloudbuild-deployer@portfolio-460206.iam.gserviceaccount.com"
      + project = "portfolio-460206"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # module.cloudbuild_connection.google_service_account.cloudbuild_service_account will be created
  + resource "google_service_account" "cloudbuild_service_account" {
      + account_id   = "cloudbuild-deployer"
      + description  = "Service account for Cloud Build to deploy to Cloud Run"
      + disabled     = false
      + display_name = "Cloud Build Deployer"
      + email        = "cloudbuild-deployer@portfolio-460206.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:cloudbuild-deployer@portfolio-460206.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "portfolio-460206"
      + unique_id    = (known after apply)
    }

  # module.cloudbuild_frontend_trigger.google_cloudbuild_trigger.github_trigger will be created
  + resource "google_cloudbuild_trigger" "github_trigger" {
      + create_time        = (known after apply)
      + description        = "Build trigger for frontend"
      + filename           = "manifests/cloudbuild/frontend.yaml"
      + id                 = (known after apply)
      + include_build_logs = "INCLUDE_BUILD_LOGS_WITH_STATUS"
      + included_files     = [
          + "apps/frontend/**",
        ]
      + location           = "us-west2"
      + name               = "frontend-trigger"
      + project            = "portfolio-460206"
      + service_account    = (known after apply)
      + trigger_id         = (known after apply)

      + approval_config (known after apply)

      + github {
          + name  = "portfolio"
          + owner = "goda6565"

          + push {
              + branch = "^(main|feat/.*)$"
            }
        }
    }

  # module.cloudbuild_frontend_trigger.google_cloudbuildv2_repository.github_repository will be created
  + resource "google_cloudbuildv2_repository" "github_repository" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + etag                  = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + name                  = "portfolio"
      + parent_connection     = (known after apply)
      + project               = "portfolio-460206"
      + remote_uri            = "https://github.com/goda6565/portfolio"
      + update_time           = (known after apply)
    }

Plan: 10 to add, 0 to change, 0 to destroy.
module.cloudbuild_connection.google_service_account.cloudbuild_service_account: Creating...
module.cloudbuild_connection.google_cloudbuildv2_connection.github_connection: Creating...
module.cloudbuild_connection.google_service_account.cloudbuild_service_account: Still creating... [00m10s elapsed]
module.cloudbuild_connection.google_cloudbuildv2_connection.github_connection: Still creating... [00m10s elapsed]
module.cloudbuild_connection.google_service_account.cloudbuild_service_account: Creation complete after 12s [id=projects/portfolio-460206/serviceAccounts/cloudbuild-deployer@portfolio-460206.iam.gserviceaccount.com]
module.cloudbuild_connection.google_project_iam_member.cloudbuild_roles["roles/artifactregistry.writer"]: Creating...
module.cloudbuild_connection.google_project_iam_member.cloudbuild_roles["roles/logging.logWriter"]: Creating...
module.cloudbuild_connection.google_project_iam_member.cloudbuild_roles["roles/cloudbuild.workerPoolUser"]: Creating...
module.cloudbuild_connection.google_project_iam_member.cloudbuild_roles["roles/secretmanager.secretAccessor"]: Creating...
module.cloudbuild_connection.google_project_iam_member.cloudbuild_roles["roles/iam.serviceAccountUser"]: Creating...
module.cloudbuild_connection.google_project_iam_member.cloudbuild_roles["roles/run.admin"]: Creating...
module.cloudbuild_frontend_trigger.google_cloudbuild_trigger.github_trigger: Creating...
module.cloudbuild_connection.google_cloudbuildv2_connection.github_connection: Creation complete after 14s [id=projects/portfolio-460206/locations/asia-northeast1/connections/github-connection]
module.cloudbuild_frontend_trigger.google_cloudbuildv2_repository.github_repository: Creating...
module.cloudbuild_connection.google_project_iam_member.cloudbuild_roles["roles/secretmanager.secretAccessor"]: Creation complete after 7s [id=portfolio-460206/roles/secretmanager.secretAccessor/serviceAccount:cloudbuild-deployer@portfolio-460206.iam.gserviceaccount.com]
module.cloudbuild_connection.google_project_iam_member.cloudbuild_roles["roles/cloudbuild.workerPoolUser"]: Creation complete after 7s [id=portfolio-460206/roles/cloudbuild.workerPoolUser/serviceAccount:cloudbuild-deployer@portfolio-460206.iam.gserviceaccount.com]
module.cloudbuild_connection.google_project_iam_member.cloudbuild_roles["roles/artifactregistry.writer"]: Creation complete after 7s [id=portfolio-460206/roles/artifactregistry.writer/serviceAccount:cloudbuild-deployer@portfolio-460206.iam.gserviceaccount.com]
module.cloudbuild_connection.google_project_iam_member.cloudbuild_roles["roles/run.admin"]: Creation complete after 7s [id=portfolio-460206/roles/run.admin/serviceAccount:cloudbuild-deployer@portfolio-460206.iam.gserviceaccount.com]
module.cloudbuild_connection.google_project_iam_member.cloudbuild_roles["roles/logging.logWriter"]: Creation complete after 7s [id=portfolio-460206/roles/logging.logWriter/serviceAccount:cloudbuild-deployer@portfolio-460206.iam.gserviceaccount.com]
module.cloudbuild_connection.google_project_iam_member.cloudbuild_roles["roles/iam.serviceAccountUser"]: Creation complete after 7s [id=portfolio-460206/roles/iam.serviceAccountUser/serviceAccount:cloudbuild-deployer@portfolio-460206.iam.gserviceaccount.com]
╷
│ Error: Error creating Trigger: googleapi: Error 400: Repository mapping does not exist. Please visit https://console.cloud.google.com/cloud-build/triggers;region=us-west2/connect?project=186242794041 to connect a repository to your project
│ 
│   with module.cloudbuild_frontend_trigger.google_cloudbuild_trigger.github_trigger,
│   on ../modules/cloudbuild/triggers/google_cloudbuild_trigger.tf line 1, in resource "google_cloudbuild_trigger" "github_trigger":
│    1: resource "google_cloudbuild_trigger" "github_trigger" {
│ 
╵
╷
│ Error: Error creating Repository: googleapi: Error 400: invalid argument: repository remote_uri must be in the format https://github.com/{owner}/{repo}.git
│ 
│   with module.cloudbuild_frontend_trigger.google_cloudbuildv2_repository.github_repository,
│   on ../modules/cloudbuild/triggers/google_cloudbuildv2_repository.tf line 1, in resource "google_cloudbuildv2_repository" "github_repository":
│    1: resource "google_cloudbuildv2_repository" "github_repository" {
│ 
╵
Releasing state lock. This may take a few moments...
::error::Terraform exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":25,"Program":"tfcmt","SHA1":"8455ce7befa86f9f074456cf711219692437905d","Vars":{},"WorkflowName":"Terraform Multi-Env CI"} -->